rootCase_samofar/constant/cavity/boussinesqProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boussinesqProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

compr   false; // true for compressible simulation

// Used only if compr is set to false

// Thermal expansion coefficient
beta    [0 0 0 -1 0 0 0]    2e-04;

// Reference temperature
TRef    [0 0 0 1 0 0 0]     900;

// Reference density
rhoRef  [1 -3 0 0 0 0 0]    2000;

// ************************************************************************* //
