rootCase_samofar/constant/cavity/fluidPorousProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousMediumProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// constants needed to calculate fluid flow in regions treated as porous medium
// all cellZones must be included
// by not defining one of the properties, a default value will be used corresponding to a region of clear fluid

model   uniformCorrelation;

correlation     GenFoam;

zones
{

    cavity
    {
        /*
        externalHeatTransferCoefficient 1e6;
        externalT           900;
        volumetricAreaSS    1;

        // The following parameters are to trick the HEX of the porous media model into
        // behaving as a clear zone. By giving a very big Nusselts number, the heat extraction
        // is dominated by the "externalHeatTransferCoefficient" above.
        hydraulicDiameter   1; // characteristic lenght
        nusseltConstTurb1   (0 0 0); // A in A*Re^b*Pr^c + D for Nusslet (turbulent case)
        nusseltConstLam1    (0 0 0); // A in A*Re^b*Pr^c + D for Nusslet (laminar case)
        nusseltReExpTurb    (0 0 0); // b in A*Re^b*Pr^c + D for Nusslet (turbulent case)
        nusseltReExpLam     (0 0 0); // b in A*Re^b*Pr^c + D for Nusslet (laminar case)
        nusseltPrExpTurb    (0 0 0); // c in A*Re^b*Pr^c + D for Nusslet (turbulent case)
        nusseltPrExpLam     (0 0 0); // c in A*Re^b*Pr^c + D for Nusslet (laminar case)
        nusseltConstTurb2   (1e7 1e7 1e7) ; // D in A*Re^b*Pr^c + D for Nusslet (turbulent case)
        nusseltConstLam2    (1e7 1e7 1e7) ; // D in A*Re^b*Pr^c + D for Nusslet (laminar case)
        */
    }

}

// Here below are listed all possible options for a porous region
// Linear interpolation between fully laminar and fully turbulent
// Principal axis of the porous region can be rotated compared to the global coordinate system. The rotated local system can be defined by defining the z and x axis. All quantities must be defined according to this coordinate system.
// The solver will take care of rotating quantities back to the global coordinate system

/*
    fluidFraction           0.2;    // fraction of the volume occupied by the fluid
    volumetricAreaSS        0.0;    // wet area diveded by total volume for sub-scale structures (equivalent eg to the area of heat exchange between fluid and sub-scale structure)
    hydraulicDiameter       0.0032;                 // characteristic lenght
    localZaxis              (0 0 1);                // z axis for the local coordinate system
    localXaxis              (1 0 0);                // x axis for the local coordinate system
    reynoldsTurb            (2e3 2e3 2e3);          // transition Reynolds to fully turbulent (one value for each principal direction)
    reynoldsLam             (1e3 1e3 1e3);          // transition Reynolds to fully laminar (one value for each principal direction)
    darcyConstTurb          (2 1 0.687);            // A in A*Re^b for Darcy friction factor (in case of turbulent flow)
    darcyConstLam           (2 1 0.687);            // A in A*Re^b for Darcy friction factor (in case of laminar flow)
    darcyExpTurb            (-0.25 -0.25 -0.25) ;   // b in A*Re^b for Darcy friction factor (in case of turbulent flow)
    darcyExpLam             (-0.25 -0.25 -0.25) ;   // b in A*Re^b for Darcy friction factor (in case of laminar flow)
    nusseltConstTurb1       (0.0185 0.0185 0.0185); // A in A*Re^b*Pr^c + D for Nusslet (turbulent case)
    nusseltConstLam1        (0.0185 0.0185 0.0185); // A in A*Re^b*Pr^c + D for Nusslet (laminar case)
    nusseltConstTurb2       (4.82 4.82 4.82) ;      // D in A*Re^b*Pr^c + D for Nusslet (turbulent case)
    nusseltConstLam2        (4.82 4.82 4.82) ;      // D in A*Re^b*Pr^c + D for Nusslet (laminar case)
    nusseltReExpTurb        (0.827 0.827 0.827);    // b in A*Re^b*Pr^c + D for Nusslet (turbulent case)
    nusseltReExpLam         (0.827 0.827 0.827);    // b in A*Re^b*Pr^c + D for Nusslet (laminar case)
    nusseltPrExpTurb        (0.827 0.827 0.827);    // c in A*Re^b*Pr^c + D for Nusslet (turbulent case)
    nusseltPrExpLam         (0.827 0.827 0.827);    // c in A*Re^b*Pr^c + D for Nusslet (laminar case)

    pumpMomentumSource      (0 0 0); // momentum source that can be used to emulate a pump region  (simply added to the momentum equation)

    externalHeatTransferCoefficient 0.0;    //heat transfer coefficient from the porous medium to a hypothetical external environment (useful for simplified heat exchangers)
    externalT               0.0;            // temperature of the hypothetical external environment (eg, secondary fluid in a heat exchanger)
    externalVolHeatSource   0;              // uniform heat source directly to the coolant
    externalRhoCp           4.8e6;          // rho*cp for the subscale structure

    turbulenceIntensityConst    (0.16 0.16 0.16);       // A in A*Re^b for turbulent intensity  (in case of laminar flow) - porouskEpsilon model should be used
    turbulenceIntensityExp      (-0.125 -0.125 -0.125); // b in A*Re^b for  turbulent intensity  (in case of laminar flow) - porouskEpsilon model should be used
    turbulenceLengthScaleConst  (0.07 0.07 0.07);       // A in A*Dh for  turbulent lenght scale  (in case of laminar flow) - porouskEpsilon model should be used
    kepsilonConvergenceRate     (5 5 5);                // rate of convergence of k and epsilon to their equilibrium value in the pororus medium (in m^-1) - porouskEpsilon model should be used
*/

// ************************************************************************* //
