rootCase_samofar/system/cavity/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-7;
        relTol          0;
    }

    "(U|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h)Final"
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    initializeSubSolver     false;
    frozenFlow              false;

    momentumPredictor   true;

    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;

    pRefCell            0;
    pRefValue           1e5;

    outerCorrectorResidualControl
    {
        U
        {
            tolerance   1e-2;
            relTol      0;
        }
        // p_rgh
        // {
        //     tolerance   5e-4;
        //     relTol      0;
        // }
        // h
        // {
        //     tolerance   1e-5;
        //     relTol      0;
        // }
    }
}

relaxationFactors
{
    fields
    {
        // "p_rgh"         0.8;
        // "p_rghFinal"    1.0;
    }
    equations
    {
        "h"             0.8;
        "U"             0.8;
        "(U|h)Final"    1.0;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

cache
{
    grad(U);
}

// ************************************************************************* //
