rootCase_samofar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    TStructures
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    TStructuresFinal
    {
        $TStructures;
        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
}

// ************************************************************************* //
